/** 
 * Текстовые сообщения к кодам ошибок
 *
 * @author mkoshkin
 */

/**
 * Коды ошибок и соответствующие им сообщения
 * 
 * @type {string[]}
 */
var CONSTANTS = {
    1: 'Вы не авторизованы',
    2: 'Заказ не найден',
    3: 'При обработке запроса возникла ошибка, повторите запрос позднее',
    4: 'Заказ уже выполнен',
    5: 'Нельзя выполнить собственный заказ',
    6: 'Неправильно указан логин',
    7: 'Не указан пароль',
    8: 'Указан неправильный пароль',
    9: 'Пользователь не найден',
    10: 'Неправильно указана сумма заказа',
	11: 'Не удалось добавить заказ'
};
